app/controllers/harsha_blogs_controller.rb

SELECT "harsha_blogs".* FROM "harsha_blogs"
---
  def index
    @harsha_blogs = HarshaBlog.all

INSERT INTO "harsha_blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "First blog"], ["body", "this is my first blog\r\n"], ["created_at", "2018-06-21 16:09:47.678746"], ["updated_at", "2018-06-21 16:09:47.678746"]]
---
  def create
    @harsha_blog = HarshaBlog.new(harsha_blog_params)

    respond_to do |format|
      if @harsha_blog.save

SELECT  "harsha_blogs".* FROM "harsha_blogs" WHERE "harsha_blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_harsha_blog
      @harsha_blog = HarshaBlog.find(params[:id])