app/controllers/pages_controller.rb

SELECT  "harsha_blogs".* FROM "harsha_blogs" LIMIT $1  [["LIMIT", 11]]
---
  def home
  	@pages = HarshaBlog.all